In [2]:
# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the 
# series.

import pandas as pd
data=[4,8,15,16,23,42]

In [3]:
ser=pd.Series(data)

In [4]:
print(ser)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [5]:
# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
# variable print it.
var=[1,2,3,4,5,6,7,8,9,10]
ser1=pd.Series(var)
print(ser1)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [17]:
# Q3. Create a Pandas DataFrame that contains the following data:
'''Name  Age  Gender 
    Alice 25   Female 
    Bob   30   Male 
    Claire   27   Female 
    Then print the dataframe'''
import pandas as pd
data1={'Name':['Alice','Bob','Clarie'],'Age':[25,30,27],'Gender':['Female','Male','Female']}
df=pd.DataFrame(data1)

In [18]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Clarie   27  Female

In [19]:
# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
''' A DataFrame is a 2-dimensional labeled data structure with columns that can be of different types.It as
similar to a SQL table, or a dictionary of Series objects.
Series: A Series is a 1-dimensional labeled array. It can hold data of any type (integer, string, float, etc.).
It's essentially a single column of data in a DataFrame '''

" A DataFrame is a 2-dimensional labeled data structure with columns that can be of different types.It as\nsimilar to a SQL table, or a dictionary of Series objects.\nSeries: A Series is a 1-dimensional labeled array. It can hold data of any type (integer, string, float, etc.).\nIt's essentially a single column of data in a DataFrame "

In [1]:
import pandas as pd 
ser=[5,54,6,3,2]
d=pd.Series(ser)
print(d)

0     5
1    54
2     6
3     3
4     2
dtype: int64

In [4]:
df={'Name':['sakshi','priya','Riya'],'Address':['Anturli','naygoan','Loni']}
ser=pd.DataFrame(df) 
ser

     Name  Address
0  sakshi  Anturli
1   priya  naygoan
2    Riya     Loni

In [27]:
# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
# you give an example of when you might use one of these functions?

In [6]:
'''To read the csv file read_csv function is their also to read the exel file read_excel function is their
and head function is their it show the first 5 record of data similarly tail function show the last 5
record in the data.'''

'To read the csv file read_csv function is their also to read the exel file read_excel function is their\nand head function is their it show the first 5 record of data similarly tail function show the last 5\nrecord in the data.'

In [11]:
import pandas as pd 
df=pd.read_csv('data.csv')

In [13]:
df.head(1)

   name           email    m_no
0  sudh  sudh@gmail.com  934567

In [14]:
df.tail(1)

    name            email     m_no
1  krish  krisk@gmail.com  8754396

In [15]:
# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
'''Series is a one dimension array is immutable in nature 
   DataFrame is a two dimension array is mutable in nature 
   Panel is a three dimension array is also mutable in nature'''

'Series is a one dimension array is immutable in nature \n   DataFrame is a two dimension array is mutable in nature \n   Panel is a three dimension array is also mutable in nature'

In [20]:
# Q7. Create a DataFrame using multiple Series. Explain with an example.

name=['sakshi','monali','vidya','Dhanshari']
id=[1,3,4,7]
fav_colour=['balck','white','red','yellow'] 
Name=pd.Series(name)
id=pd.Series(id)
Colour=pd.Series(fav_colour)

In [27]:
df=pd.DataFrame({'Name':Name,'id':id,'fav_Colour':Colour})

In [28]:
df

        Name  id fav_Colour
0     sakshi   1      balck
1     monali   3      white
2      vidya   4        red
3  Dhanshari   7     yellow